//Напишите программу, которая определяет, является ли введенное число кратным 3 и 5 одновременно.


#include <iostream>

using namespace std;
int main () {
setlocale(0, "");
int num;

cout << "введите число: ";
cin >> num;

if (num % 3 == 0 && num % 5 == 0) {
        cout << "число кратно 5 и 3";
}
else {
cout << "число не кратно 5 и 3";
}
return 0;
}