//Напишите программу, которая определяет, является ли введенное число факториалом другого числа.


#include <iostream>

using namespace std;

setlocale(0, "");
int num1, num2, count;
cout << "введите первое число: ";
cin >> num1;
cout << "введите второе число: ";
cin >> num2;
count = 1;
for(int i = 1; i <= num1; i++){
    count=count*i;
}
if(count==num2){
    cout << "первое число является факториалом второго";
}else{
    cout << "первое число не является факториалом второго";
}
}