// Напишите программу, которая проверяет, является ли введенное число положительным, отрицательным или нулем.


#include <iostream>
using namespace std;

int main() {
setlocale(0, "");
int num;
cout << "введите число: ";
cin >> num;

if (num > 0) {
    cout << "это положительное число ";
}
else if (num < 0) {
    cout << "это отрицательоне число ";
}
else {
    cout << "это ноль";
}
return 0;
}